In [3]:
import pandas as pd
data = {    
'Name': ['John', 'Alice', 'Bob', 'John', 'Alice', 'Charlie'],    
'Age': [28, 24, 22, 28, 24, 30],    
'City': ['New York', 'Los Angeles', 'San Francisco', 'New York', 'Los Angeles', 'Chicago']}

df = pd.DataFrame(data) 
df

      Name  Age           City
0     John   28       New York
1    Alice   24    Los Angeles
2      Bob   22  San Francisco
3     John   28       New York
4    Alice   24    Los Angeles
5  Charlie   30        Chicago

In [4]:
duplicated_rows = df.duplicated()
duplicated_rows

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [5]:
df_no_duplicates = df.drop_duplicates() # drop the duplicate values

df_no_duplicates

      Name  Age           City
0     John   28       New York
1    Alice   24    Los Angeles
2      Bob   22  San Francisco
5  Charlie   30        Chicago

In [6]:
# handling duplicates in specific columns 
duplicated_names = df.duplicated(subset=['Name'])

duplicated_names

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [7]:
df_no_duplicates = df.drop_duplicates(subset=['Name'])

df_no_duplicates

      Name  Age           City
0     John   28       New York
1    Alice   24    Los Angeles
2      Bob   22  San Francisco
5  Charlie   30        Chicago

In [8]:
# keeping certain duplicates 
df_keep_last = df.drop_duplicates(keep='last')
df_keep_last

      Name  Age           City
2      Bob   22  San Francisco
3     John   28       New York
4    Alice   24    Los Angeles
5  Charlie   30        Chicago

In [9]:
df

      Name  Age           City
0     John   28       New York
1    Alice   24    Los Angeles
2      Bob   22  San Francisco
3     John   28       New York
4    Alice   24    Los Angeles
5  Charlie   30        Chicago

In [10]:
# remove all occurrences of duplicates 

df_remove_all = df.drop_duplicates(keep=False)

df_remove_all

      Name  Age           City
2      Bob   22  San Francisco
5  Charlie   30        Chicago